/**
 * Created by Echo on 2016/4/27.
 */

    /*日比，周比的表格数据格式*/
/**
 * key是竖着的一列
 * value是该列对应的一行
 * 其中dd是随便取名字都可以的任意值
 * */
var data =  {
    pv: {
        dd: '7014',
        today: '今日(20160426)2545',
        yesterday: '昨日(20160425)2277',
        ribi: '日比7260',
        lastweek: '上周(20160426-20160420)1808',
        zhoubi: '周比3239'
    },
    uv: {
        dd: '368',
        today: '今日(20160426)2190',
        yesterday: '昨日(20160425)8500',
        ribi: '日比7707',
        lastweek: '上周(20160426-20160420)1666',
        zhoubi: '周比5788'
    },
    gmrs: {
        dd: '1202',
        today: '今日(20160426)8984',
        yesterday: '昨日(20160425)5860',
        ribi: '日比4514',
        lastweek: '上周(20160426-20160420)7422',
        zhoubi: '周比5901'
    },
    gml:{ dd: '8644',
        today: '今日(20160426)321',
        yesterday: '昨日(20160425)818',
        ribi: '日比1806',
        lastweek: '上周(20160426-20160420  )1204',
        zhoubi: '周比5400' },
    ckl:{ dd: '6623',
        today: '今日(20160426)5570',
        yesterday: '昨日(20160425)6661',
        ribi: '日比8910',
        lastweek: '上周(20160426-20160420)3050',
        zhoubi: '周比8133' },
    ckls:{ dd: '400',
        today: '今日(20160426)4031',
        yesterday: '昨日(20160425)1251',
        ribi: '日比5116',
        lastweek: '上周(20160426-20160420)3976',
        zhoubi: '周比9379' },
    zxf:{ dd: '4878',
        today: '今日(20160426)5408',
        yesterday: '昨日(20160425)6196',
        ribi: '日比6082',
        lastweek: '上周(20160426-20160420)177',
        zhoubi: '周比9525' },
    xjxf:{ dd: '3942',
        today: '今日(20160426)1581',
        yesterday: '昨日(20160425)9605',
        ribi: '日比1438',
        lastweek: '上周(20160426-20160420)7824',
        zhoubi: '周比2614' },
    yhxf:{ dd: '3273',
        today: '今日(20160426)4098',
        yesterday: '昨日(20160425)2551',
        ribi: '日比6019',
        lastweek: '上周(20160426-20160420)3950',
        zhoubi: '周比4682' },
    arpu:{ dd: '421',
        today: '今日(20160426)7240',
        yesterday: '昨日(20160425)7139',
        ribi: '日比1503',
        lastweek: '上周(20160426-20160420)4642',
        zhoubi: '周比9948' },
    gmcg:{ dd: '9638',
        today: '今日(20160426)7991',
        yesterday: '昨日(20160425)8132',
        ribi: '日比8004',
        lastweek: '上周(20160426-20160420)4317',
        zhoubi: '周比9016' },
    gmsb:{ dd: '8959',
        today: '今日(20160426)4069',
        yesterday: '昨日(20160425)7639',
        ribi: '日比3430',
        lastweek: '上周(20160426-20160420)3673',
        zhoubi: '周比2361' },
    tkrs:{ dd: '708',
        today: '今日(20160426)9786',
        yesterday: '昨日(20160425)8571',
        ribi: '日比3584',
        lastweek: '上周(20160426-20160420)7098',
        zhoubi: '周比436' }
};

/*各个平台购买人数和购买量的第二个表格*/
var data2 = {
    pc: { gml: '购买量8520', gmrs: '购买人数1599' },
    m: { gml: '购买量8253', gmrs: '购买人数5164' },
    app: { gml: '购买量2518', gmrs: '购买人数6559' },
    sum: { gml: '购买量5798', gmrs: '购买人数369' }
};

/*第三个表格--各个品牌购买量和购买人数,数据格式跟之前一样*/
var data3 = {"data":[{"brand":"\u4e00\u6c7d\u5927\u4f17\/\u5965\u8fea","gml":7,"gmrs":7},{"brand":"\u5954\u9a70","gml":3,"gmrs":2},{"brand":"\u65af\u67ef\u8fbe","gml":3,"gmrs":3},{"brand":"\u5b9d\u9a6c","gml":3,"gmrs":3},{"brand":"\u5317\u4eac\u73b0\u4ee3","gml":3,"gmrs":3},{"brand":"\u652f\u6301\u54c1\u724c","gml":2,"gmrs":2},{"brand":"\u514b\u83b1\u65af\u52d2","gml":2,"gmrs":2},{"brand":"\u4e00\u6c7d\u4e30\u7530","gml":2,"gmrs":2},{"brand":"\u8fdb\u53e3\u5927\u4f17","gml":1,"gmrs":1}],"rows_count":9};